package com.Butter.ICTCLAS;

public interface StopWord {

	public static final String[] stopWords = { 
		    // 动词
	        "说", "像", "想", "成", "为", "到", "要", "会", "做", "找", "送", "如", "给", 
	        "看", "可", "让", "称", "有", "无", "没", "请", "开", "问", "拿", "叫", "吃", 
	        "走", "发", "买", "卖", "用", "扔", "爱", "应", "能", "见", "带", "子", "了",
	        "余", "使", "需", "转", "回", "放",
	        "可以", "成为", "没有", "表示", "进行", "知道", "发现", "应该", "认为", "需要",
			"出现", "不能", "转发", "发表", "开始", "分享", "察看", "可能", "看到", "要求",
			"回复", "使用", "继续", "查看", "是否", "导致", "决定", "来自",
			// 数量词
			"一", "二", "三", "四", "五", "六", "七", "八", "九", "十", "百", "千", "万",
			"一个", "两", "多", "少", "几", "一些", "很多", "首", "很少", "1", "2", "3",
			"4", "5", "6", "7", "8", "9",
			// 时间
			"时", "分", "秒", "小时",
			// 名词
			"路", "人", "事", "亲", "话", "家", "月", "国",
			"新闻", "生活", "世界", "事件", "微博", "评论", "时间", "图片", "国家",
			// 网络流行语
			"亲", "亲们", "切", "额", "给力", "灌水", "酱紫", "靠", "晕倒", "屌丝", "屌", "纳尼",
			"小三", "神马",
			// 其他
			"的", "得", "地", "行", "完", "时候", "一下", "就是", "部分", "觉得", "还有", "有关"};

}